{
  "code": 10000,
  "message": "success",
  "tid": "9f71b4df7b11fffb17e2e0cb9fc629c8",
  "data": {
    "lottery_time": 1757833200000,
    "treasure_name": "Win ₱3,200 or Realme T300 ",
    "img_style_type": 0,
    "lottery_mode": 2,
    "treasure_cover_img": "https://prod-pesolucky.s3.ap-east-1.amazonaws.com/avatar/202508191540333d2e6ad1-1fdf-4c96-b224-8342bc6a4688.jpg",
    "rule_content": "\u003cp\u003e\u0026nbsp;\u003c/p\u003e\u003cp\u003eWelcome to luck, a raffle and playing platform operated by Gavin Ventures Inc., licensed under . By using our platform, you agree to the following terms:\u003c/p\u003e\u003ch3\u003e\u003cstrong\u003e1. play\u003c/strong\u003e\u003c/h3\u003e\u003cul\u003e\u003cli\u003eThere are two main playing modes:\u003cbr\u003e\u003cbr\u003e\u003cul\u003e\u003cli\u003e\u003cstrong\u003eSold Out Mode\u003c/strong\u003e\u003cbr\u003eThe raffle begins with a fixed number of tickets available. The playing ends once all tickets are sold, and then a winner is drawn.\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eTime Limit Mode\u003c/strong\u003e\u003cbr\u003eThe raffle has a fixed duration. If minimum sales are reached, a winner is drawn at the set time.\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003c/ul\u003e\u003c/li\u003e\u003cli\u003eMinimum bet per ticket is ₱1.00.\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003cli\u003eTickets can be purchased using either your Cash Wallet balance or Lucky Coin Wallet balance. Each raffle draw has a maximum ticket limit per person to ensure fair play and give all participants an equal chance of winning. This can be found on each Raffle Draw Info Panel as shown below.\u003c/li\u003e\u003c/ul\u003e\u003cfigure class=\"image\"\u003e\u003cimg style=\"aspect-ratio:240/164;\" src=\"https://lh7-rt.googleusercontent.com/docsz/AD_4nXd0TPIKdv9PE3TD4XgS6C7UXkwNolhurCbIz6CA2GYDQU5VQPwArSHzQo2ntI4SU8pj0-rLgKflskQRnkpLe32xF7NBPAlwc7lRBrjHfeSZcjyR_COsObVBq-jAxr3Y_wkJ_YDcbcIA8wFlINucb2g?key=8CJrDTw4oVm-G-sVXKqXmcmT\" width=\"240\" height=\"164\"\u003e\u003c/figure\u003e\u003cul\u003e\u003cli\u003eUpon ticket purchase, the system will assign a unique Ticket Reference ID per entry.\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003cli\u003eBets are final and must be placed before draw deadlines.\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003cli\u003ePurchasing at least one ticket automatically allows you to Create a Team where you can invite players to join your personal Raffle Team for a greater chance to win prizes or earn Lucky Coins, which can then be used to get discounts and other exclusive items.\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u0026nbsp;\u003c/p\u003e\u003cfigure class=\"image\"\u003e\u003cimg style=\"aspect-ratio:430/932;\" src=\"https://prod-pesolucky.s3.ap-east-1.amazonaws.com/rule/2025051916030747005304-3bcc-465a-a41b-3f1a5e69ce66.png\" width=\"430\" height=\"932\"\u003e\u003c/figure\u003e\u003cfigure class=\"image\"\u003e\u003cimg style=\"aspect-ratio:430/734;\" src=\"https://prod-pesolucky.s3.ap-east-1.amazonaws.com/rule/202508141810134b87e9e3-c5cc-4bb0-90ff-03c341ca728b.jpg\" width=\"430\" height=\"734\"\u003e\u003c/figure\u003e\u003cp\u003e\u0026nbsp;\u003c/p\u003e\u003cfigure class=\"image\"\u003e\u003cimg style=\"aspect-ratio:430/331;\" src=\"https://prod-pesolucky.s3.ap-east-1.amazonaws.com/rule/202505191435164ad7af99-b849-4c0f-b9ab-518e10cda8eb.png\" width=\"430\" height=\"331\"\u003e\u003c/figure\u003e\u003cul\u003e\u003cli\u003eExchange Rate: 1 Peso = 10 Lucky Coins\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eWIN A FORTUNE BAG.\u003c/strong\u003e If a member of your team wins the raffle prize, all members of the said team (excluding the actual winner) will receive a Fortune Bag.\u003cbr\u003e\u003cbr\u003eThe Fortune Bag is automatically awarded to the team of the raffle prize winner and serves as a consolation prize for the other team members who didn't win the Raffle Prize.\u003cbr\u003e\u003cbr\u003eIt contains Lucky Coins, which are evenly distributed among the said team members.\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003c/ul\u003e\u003cfigure class=\"image\"\u003e\u003cimg style=\"aspect-ratio:430/682;\" src=\"https://prod-pesolucky.s3.ap-east-1.amazonaws.com/rule/202505191434582888e99b-aaab-4fa0-9945-64917f2ee836.png\" width=\"430\" height=\"682\"\u003e\u003c/figure\u003e\u003cul\u003e\u003cli\u003e\u003cstrong\u003eLUCKY COINS.\u003c/strong\u003e Lucky Coins can be used to get discounts when purchasing raffle draw tickets, giving players more chances to win exciting prizes.\u003cbr\u003eThere are several ways to get Lucky Coins:\u003cbr\u003e\u003cbr\u003e1. Win a Fortune Bag.\u0026nbsp;\u003cbr\u003eSee the previous section “Win a Fortune Bag” for more details.\u003cbr\u003e\u003cbr\u003e2. Invite Friends to Join luck\u003cbr\u003eRefer to the “Invite Friends” section for more information.\u003cbr\u003e\u003cbr\u003e3. Redeem a Code\u003cbr\u003eClaim Lucky Coins using a Redeem Code. See “Lucky Coins → Redeem Lucky Coins” for details. Stay tuned to our official social media accounts (ex. Facebook, etc.) for you to get our latest marketing promotion updates and a chance to receive a code.\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u0026nbsp;\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cstrong\u003eLUCK VOUCHERS. \u003c/strong\u003eluck vouchers let you enjoy discounts when joining raffle draws, helping you save money and play more for a chance to win a prize.\u0026nbsp;\u003cbr\u003e\u003cbr\u003e\u003cul\u003e\u003cli\u003eSpend \u0026amp; Save Vouchers\u003cbr\u003eGet a discount when you spend a certain amount.\u003cbr\u003eExample: Spend ₱100, get ₱20 off.\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003cli\u003eNo Minimum Vouchers\u003cbr\u003eNo minimum spend required—just use the voucher directly.\u003cbr\u003eExample: Get ₱5 off instantly.\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003cli\u003eItem-Specific Vouchers\u003cbr\u003eThese only apply to certain raffle items.\u003cbr\u003eExample: A ₱10 off voucher for a specific Raffle Prize.\u003cbr\u003e\u003cbr\u003eYou can get vouchers by claiming them in the app or by completing tasks like signing up, inviting friends, or spending a set amount. During checkout, valid vouchers will show up automatically, and you can choose which one to use—just note that vouchers and Lucky Coins can’t be used together, and the system will automatically apply the better discount. Only 1 voucher can be used in a single transaction.\u003cbr\u003e\u003cbr\u003eEach voucher can be used once, won’t be returned after use or canceled raffles, and will expire after a set time if unused.\u003cbr\u003e\u003cbr\u003eSee “Account → My Vouchers → Rules” for more info.\u003c/li\u003e\u003c/ul\u003e\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u0026nbsp;\u003c/p\u003e\u003cul\u003e\u003cli\u003e\u003cstrong\u003eVIEW ALL ORDERS.\u0026nbsp;\u003c/strong\u003eYou can track all your raffle draw entries by clicking on the View All Orders tab. This section is divided into three categories:\u003cbr\u003e\u003cbr\u003e\u003cul\u003e\u003cli\u003e\u003cstrong\u003eActive\u003c/strong\u003e\u003cbr\u003eRaffle tickets that are currently pending or awaiting results.\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eEnded\u003c/strong\u003e\u003cbr\u003eRaffle tickets that have already been drawn. This section includes three subcategories:\u003cbr\u003e\u003cbr\u003e\u003cul\u003e\u003cli\u003eLost – Tickets that did not win.\u003c/li\u003e\u003cli\u003ePrize Won – Tickets that won a raffle prize.\u003c/li\u003e\u003cli\u003eLucky Coin Won – Tickets that earned Lucky Coins through a Fortune Bag.\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003c/ul\u003e\u003c/li\u003e\u003cli\u003e\u003cstrong\u003eRefund\u003c/strong\u003e\u003cbr\u003eAll Raffle Tickets that are cancelled and funds refunded back to your luck Wallet.\u003cbr\u003e\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003c/ul\u003e\u003c/li\u003e\u003cli\u003eRaffle draws use randomized and -compliant RNG systems.\u003cbr\u003e\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003cli\u003eluck may cancel or reschedule draws in Sold Out Mode. In Sold Out Mode, if all tickets are not sold within 120 days, the raffle draw will be deemed cancelled, and the amount paid for all purchased tickets will be refunded back to the players.\u003cbr\u003e\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003cli\u003e10.00% of the Net Revenue is given to OKCares Foundation Inc. to support ’s community-building initiatives.\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003c/ul\u003e\u003ch3\u003e\u003cstrong\u003e2. Prizes\u003c/strong\u003e\u003c/h3\u003e\u003cul\u003e\u003cli\u003eAfter a Player wins the Raffle Prize, a system prompt will appear, allowing the Player to choose their final preferred Prize option: Cash Prize (primary) or the corresponding Item Prize (alternative). Don’t miss out! Prizes expire 7 days after winning.\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003cli\u003eWinners are required to initiate the prize claim procedure by contacting customer support within seven (7) calendar days from the date of winning. Non-compliance within the specified timeframe shall constitute automatic forfeiture of the prize with no obligation for the platform to distribute the award.\u003cbr\u003e\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003c/ul\u003e\u003cfigure class=\"image\"\u003e\u003cimg style=\"aspect-ratio:497/1078;\" src=\"https://prod-pesolucky.s3.ap-east-1.amazonaws.com/rule/20250612082609ff17f4d1-e3e5-4ddb-9cc9-2f487205a977.png\" width=\"497\" height=\"1078\"\u003e\u003c/figure\u003e\u003cp\u003e\u0026nbsp;\u003c/p\u003e\u003cul\u003e\u003cli\u003eThe Item Prize refers to a physical or virtual item that has the same monetary equivalent as the Cash Prize being drawn.\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003cli\u003eWinners are chosen randomly and Prizes will be given to the winner within 30 days.\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003cli\u003eWinners must confirm their delivery address in \"My Raffle Tickets → Order Detail.\" If no confirmation is made, the prize will be shipped to the original address used during payment.\u0026nbsp;\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003cli\u003eThe platform will process and ship Physical prize/s within 7 business days, and will provide a Tracking Number for reference.\u0026nbsp;\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003cli\u003eVirtual prize/s will be credited to the winner’s account within 24 hours or made available in the order details section with the necessary redemption details (e.g., card number and password).\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003cli\u003eWhen a player wins and selects the Cash Prize, they must send an email with their preferred payment method details to luck Customer Support. The support email is displayed immediately upon selecting the Cash Prize option.\u003cbr\u003e\u003cbr\u003eOnce verified, the cash prize will be processed and sent to the player’s chosen payment method within seven days, along with a transaction receipt.\u003cbr\u003e\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003cli\u003eWinners will be notified via:\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cbr\u003e\u0026nbsp;\u003c/p\u003e\u003cul\u003e\u003cli\u003eOrders page\u003c/li\u003e\u003c/ul\u003e\u003cfigure class=\"image\"\u003e\u003cimg style=\"aspect-ratio:430/932;\" src=\"https://prod-pesolucky.s3.ap-east-1.amazonaws.com/rule/20250519160408e603f1d4-fdf4-466c-b47a-15bb6c8fcd26.png\" width=\"430\" height=\"932\"\u003e\u003c/figure\u003e\u003cul\u003e\u003cli\u003eWinners Tab\u003c/li\u003e\u003c/ul\u003e\u003cfigure class=\"image\"\u003e\u003cimg style=\"aspect-ratio:430/932;\" src=\"https://prod-pesolucky.s3.ap-east-1.amazonaws.com/rule/2025051914341850e331cb-0113-411b-9ca1-f690606c1419.jpg\" width=\"430\" height=\"932\"\u003e\u003c/figure\u003e\u003cul\u003e\u003cli\u003eMessage Center \u0026amp; SMS Notification\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003cli\u003eApp Homepage\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003cli\u003eValid ID is required for prize collection.\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003cli\u003eIf the original prize is unavailable due to circumstances, it may be substituted with cash or an alternative of similar value at luck's sole discretion.\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003cli\u003eIssues regarding Prize/s will be duly resolved within 60 calendar days.\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003cli\u003eAll taxes incurred in relation to the prize(s) won are the responsibility of the winner.\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003cli\u003eThis platform is not affiliated with, sponsored by, or associated in any way with Apple Inc.\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003cli\u003eRecipients of major prizes (e.g., vehicles, real estate) should note that prize transfer will require processing time and completion of legal documentation.\u003c/li\u003e\u003c/ul\u003e\u003ch3\u003e3. Eligibility\u003c/h3\u003e\u003cul\u003e\u003cli\u003eYou must be 21 years or older and a resident of the Philippines.\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003cli\u003eThe following are not allowed to play: luck and  employees, their families, individuals on the Restricted Persons List, those who opted for self-exclusion, foreign nationals and other individuals restricted by Philippine law.\u003c/li\u003e\u003c/ul\u003e\u003ch3\u003e4. Accounts\u003c/h3\u003e\u003cul\u003e\u003cli\u003eOne account per person. Use only valid personal info (email, mobile number, etc.).\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003cli\u003eYou're responsible for keeping your login credentials secure.\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003cli\u003eWe may request ID verification (KYC) anytime. Non-compliance shall lead to account investigation and/or suspension.\u003c/li\u003e\u003c/ul\u003e\u003ch3\u003e5. Gross playing Revenue (GGR) Computation\u003c/h3\u003e\u003cul\u003e\u003cli\u003eluck GGR is calculated as follows:\u003cbr\u003e\u003cbr\u003eGGR = Total Ticket Sales - Total Prizes Awarded\u003cbr\u003e\u003cbr\u003ewhere:\u003cbr\u003e\u003cbr\u003e\u003cstrong\u003eTotal Ticket Sales\u003c/strong\u003e:\u003cbr\u003eThe full amount of money collected from all users who purchased luck Raffle Draw Tickets.\u003cbr\u003e\u003cbr\u003e\u003cstrong\u003eTotal Prizes Awarded\u003c/strong\u003e:\u003cbr\u003eThe total monetary value of all the prizes given out to luck Raffle Draw winners.\u003c/li\u003e\u003c/ul\u003e\u003ch3\u003e6. Forfeiture Policy\u003c/h3\u003e\u003cul\u003e\u003cli\u003eSuspicious activity shall lead to investigation and/or or account suspension. Accounts of ineligible and banned users shall be closed and funds forfeited in favor of the Philippine government.\u003c/li\u003e\u003c/ul\u003e\u003ch3\u003e7. Responsible playing\u003c/h3\u003e\u003cul\u003e\u003cli\u003ePlay responsibly. Tools are available to help manage play time and spending.\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003cli\u003ePlaying in public spaces (schools, offices, churches, etc.) is prohibited.\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003cli\u003eYou may request self-exclusion at any time via Customer Support.\u003c/li\u003e\u003c/ul\u003e\u003ch3\u003e8. Security \u0026amp; Fair Play\u003c/h3\u003e\u003cul\u003e\u003cli\u003eFraud, cheating, use of bots, or multiple accounts is strictly prohibited.\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003cli\u003eAny suspicious activity will lead to investigation, suspension, or a permanent ban.\u003c/li\u003e\u003c/ul\u003e\u003ch3\u003e9. Privacy\u003c/h3\u003e\u003cul\u003e\u003cli\u003eWe comply with the Data Privacy Act of 2012.\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003cli\u003eYour data is used only for operations, legal compliance, or marketing—with your consent.\u003c/li\u003e\u003c/ul\u003e\u003ch3\u003e10. Liability\u003c/h3\u003e\u003cul\u003e\u003cli\u003eWe are not responsible for technical issues, account misuse, or internet failures.\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003cli\u003eOur maximum liability is limited to the value of your last valid bet.\u003c/li\u003e\u003c/ul\u003e\u003ch3\u003e11. Changes to Terms\u003c/h3\u003e\u003cul\u003e\u003cli\u003eThese Terms may change anytime upon prior approval of . Updates will be posted on the platform.\u003cbr\u003e\u0026nbsp;\u003c/li\u003e\u003cli\u003eContinued use of luck means you accept the latest terms.\u003c/li\u003e\u003c/ul\u003e\u003ch3\u003e12. Legal\u003c/h3\u003e\u003cul\u003e\u003cli\u003eThese Terms and Conditions follow Philippine laws.\u0026nbsp;\u003c/li\u003e\u003c/ul\u003e\u003ch3\u003e13. Support\u003c/h3\u003e\u003cp\u003eNeed help? Our 24/7 Customer Support is available through our Help Center or official social media pages.\u003c/p\u003e",
    "cost_amount": 3500,
    "unit_amount": 1,
    "main_image_list": [
      "https://prod-pesolucky.s3.ap-east-1.amazonaws.com/avatar/2025081915411981febf27-0026-4da7-93fc-c696f46463b8.jpg"
    ],
    "desc": "\u003cp\u003e\u003cimg src=\"https://prod-pesolucky.s3.ap-east-1.amazonaws.com/rule/20250819154125141c3746-11dd-48cd-bc3b-0c10294513ab.png\" width=\"750\" height=\"500\"\u003erealme Buds T300（Global Version）：\u003cbr\u003ePort charge\u003c/p\u003e\u003cul\u003e\u003cli\u003eUSB Type-C\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eCharging\u003c/p\u003e\u003cul\u003e\u003cli\u003eUSB Type C wired charging\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eBluetooth Version\u003c/p\u003e\u003cul\u003e\u003cli\u003eBluetooth 5.3\u003c/li\u003e\u003c/ul\u003e\u003cp\u003e\u003cbr\u003eAudio codecs\u003c/p\u003e\u003cul\u003e\u003cli\u003eAAC, SBC\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eWireless Range\u003c/p\u003e\u003cul\u003e\u003cli\u003e10m\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eSize of sound\u003c/p\u003e\u003cul\u003e\u003cli\u003e12,4mm\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eBattery capacity\u003c/p\u003e\u003cul\u003e\u003cli\u003eCharging case:460mAh; Single earbud: 43mAh\u003cbr\u003eCharging Time\u003c/li\u003e\u003cli\u003eCharging Case + Buds:10mins Charging for 7hrs Playback (50% Volume,ANC OFF)\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eWaterproof Rating\u003c/p\u003e\u003cul\u003e\u003cli\u003eIP55 (earphones only)\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eNoise Cancelling Features\u003c/p\u003e\u003cul\u003e\u003cli\u003e30dB Active Noise Cancelling, Environment Noise Cancelling\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eBattery (Charging case + Buds)\u003c/p\u003e\u003cul\u003e\u003cli\u003eMusic playback 40hrs (50% Volume,ANC OFF); Music playback 30hrs (50% Volume,ANC ON)\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eBattery (Earbuds Alone)\u003c/p\u003e\u003cul\u003e\u003cli\u003e8hrs Music Playback (50% Volume,ANC OFF); 6hrs Music Playback (50% Volume,ANC ON); 4hrs Calling Time (50% Volume,ANC OFF/ON)\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eInside the box\u003c/p\u003e\u003cul\u003e\u003cli\u003eRealme Buds T300 x 1\u003c/li\u003e\u003cli\u003eCharging Cable Type C x 1\u003c/li\u003e\u003cli\u003eInformation Card x1/\u003c/li\u003e\u003cli\u003eS/M/L Silicone Eartips x 2\u003c/li\u003e\u003c/ul\u003e",
    "min_buy_quantity": 4600,
    "seq_shelves_quantity": 4600,
    "seq_buy_quantity": 2774,
    "buy_quantity_rate": "60.30",
    "max_unit_coins": 0.5,
    "max_unit_amount": 0.05,
    "max_per_buy_quantity": 46,
    "treasure_seq": "570914867729465601",
    "treasure_id": 10,
    "group_max_num": 9999,
    "charity_amount": 31.34,
    "cash_state": 1
  }
}